app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories"
---
  def index
    @inventories = Inventory.all

INSERT INTO "inventories" ("item", "Price", "condition", "description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item", "okay"], ["Price", 199], ["condition", "ok"], ["description", "Good"], ["status", true], ["created_at", 2018-03-11 19:32:44 UTC], ["updated_at", 2018-03-11 19:32:44 UTC]]
---
  def create
    @inventory = Inventory.new(inventory_params)

    if @inventory.save

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_inventory
      @inventory = Inventory.find(params[:id])